app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "while coding is hard work, it is also fun. I enjoy coding!"], ["updated_at", "2021-03-30 03:05:49.799382"], ["id", 18]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)